&НаКлиенте
Перем git;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ФайлОбработки = Новый Файл(ОбработкаОбъект.ИспользуемоеИмяФайла);
	ТекущийКаталог = ФайлОбработки.Путь;
	
КонецПроцедуры

&НаКлиенте
Procedure WriteText(FilePath, FileText)
	TextWriter = New TextWriter;
	TextWriter.Open(FilePath, TextEncoding.UTF8);
	TextWriter.Write(FileText);
	TextWriter.Close();
EndProcedure

&НаКлиенте
Процедура Test(AddInId) Экспорт
	
	git = Новый("AddIn." + AddInId + ".GitFor1C");
	
	ИмяФайла = "Autotest";
	ВременнаяПапка = ПолучитьИмяВременногоФайла("git");
	УдалитьФайлы(ВременнаяПапка);
	СоздатьКаталог(ВременнаяПапка);
	ВременнаяПапка = ВременнаяПапка + "/" + ИмяФайла + "/";
	СоздатьКаталог(ВременнаяПапка);
	СоздатьКаталог(ВременнаяПапка + "include");
	СоздатьКаталог(ВременнаяПапка + "Example");
	СоздатьКаталог(ВременнаяПапка + "Example/Features");
	СоздатьКаталог(ВременнаяПапка + "src");
	СоздатьКаталог(ВременнаяПапка + "tools");
	
	МассивФайлов = Новый Массив;
	МассивФайлов.Добавить("LICENSE");
	МассивФайлов.Добавить("Example.xml");
	МассивФайлов.Добавить("Example/Features/НажатиеМыши.feature");
	МассивФайлов.Добавить("include/ComponentBase.h");
	МассивФайлов.Добавить("include/types.h");
	МассивФайлов.Добавить("src/AddInBase.cpp");
	МассивФайлов.Добавить("src/AddInBase.h");
	МассивФайлов.Добавить("src/json.hpp");
	МассивФайлов.Добавить("tools/Compile.os");
	МассивФайлов.Добавить("tools/Decompile.os");
	
	git.init(ВременнаяПапка);
	Для каждого ИмяФайла Из МассивФайлов Цикл
		КопироватьФайл(ТекущийКаталог + ИмяФайла, ВременнаяПапка + ИмяФайла);
	КонецЦикла;
	git.add(FormOwner.JsonDump(МассивФайлов));
	git.commit("Инициализация");
	
	ИмяФайла = "tools/Decompile.os";
	ПолноеИмя = ВременнаяПапка + ИмяФайла;
	УдалитьФайлы(ПолноеИмя);
	
	ИмяФайла = "Example.xml";
	ПолноеИмя = ВременнаяПапка + ИмяФайла;
	УдалитьФайлы(ПолноеИмя);
	git.remove(ИмяФайла);
	
	ИмяФайла = "tools/Compile.os";
	ПолноеИмя = ВременнаяПапка + ИмяФайла;
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Прочитать(ПолноеИмя, КодировкаТекста.UTF8);
	Для НомерСтроки = 1 По 4 Цикл
		Стр = ТекстовыйДокумент.ПолучитьСтроку(7);
		ТекстовыйДокумент.ВставитьСтроку(70, Стр);
		ТекстовыйДокумент.УдалитьСтроку(7);
	КонецЦикла;
	ТекстовыйДокумент.Записать(ПолноеИмя, КодировкаТекста.UTF8);
	git.add(ИмяФайла);
	
	ИмяФайла = "src/AddInBase.cpp";
	ПолноеИмя = ВременнаяПапка + ИмяФайла;
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Прочитать(ПолноеИмя, КодировкаТекста.UTF8);
	ТекстовыйДокумент.ВставитьСтроку(3, "// " + ЧислоПрописью(51243, "L=en_US"));
	ТекстовыйДокумент.ВставитьСтроку(4, "// " + ЧислоПрописью(24565, "L=en_US"));
	ТекстовыйДокумент.ВставитьСтроку(5, "");
	ТекстовыйДокумент.Записать(ПолноеИмя, КодировкаТекста.UTF8);
	git.add(ИмяФайла);
	
	МассивФайлов = Новый Массив;
	МассивФайлов.Добавить(ВременнаяПапка);
	ВладелецФормы.OpenFolderEnd(МассивФайлов, Undefined);
	
КонецПроцедуры